Revit 2026 API

# FabricationConfigurationUnloadServices Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void UnloadServices(
	IList<int> serviceIds
)
```
```vb
Public Sub UnloadServices (
	serviceIds As IList(Of Integer)
)
```
```cpp
public:
void UnloadServices(
	IList<int>^ serviceIds
)
```
```fsharp
member UnloadServices :
        serviceIds : IList<int> -> unit
```

#### Parameters

serviceIds IListInt32

#### Reference

FabricationConfiguration Class

Autodesk.Revit.DB Namespace